// 3.1 데이터와 자료형
/*
	정수 자료형 : 정수값을 저장하는 자료형
	
	정수 자료형		|	저장 공간 크기[Byte]	|	값의 범위
	char			|			1			|	-128 ~ 127 또는 0 ~ 255
	unsigned char	|			1			|	0 ~ 255
	signed char		|			1			|	-128 ~ 127
	int				|		2 또는 4			|	-32,768 ~ 32,767 또는 -2,147,483,648 ~ 2,147,483,647
	unsigned int	|		2 또는 4			|	0 ~ 65,535 또는 0 ~ 4,294,967,295
	short			|			2			|	-32,768 ~ 32,767
	unsigned short	|			2			|	0 ~ 65,535
	long			|			4			|	-2,147,483,648 ~ 2,147,483,647
	unsigned long	|			4			|	0 ~ 4,294,967,295


	실수 자료형 : 실수값을 저장하는 자료형

	실수 자료형		|	저장 공간 크기[Byte]	|	값의 범위					|	십진수 정밀도
	float			|			4			|	1.2E-38 ~ 3.4E+38		|		6자리
	double			|			8			|	2.3E-308 ~ 1.7E+308		|		15자리
	long double		|			10			|	3.4E-4932 ~ 1.1E+4932	|		19자리

*/

#include <stdio.h>
int main()
{
	return 0;
};